wjw890912/Power-measurementV0.2/ADE7878_NUC422_Softwave/NUC472_NUC442_BSP_CMSIS_V3.01.000/NUC400SeriesBSP_CMSIS_V3.01.000/Library/UsbHostLib/SOURCE/Core/usbh_core.c
/*
 * drivers/usb/usb.c
 *
 * (C) Copyright Linus Torvalds 1999
 * (C) Copyright Johannes Erdfelt 1999
 * (C) Copyright Andreas Gal 1999
 * (C) Copyright Gregory P. Smith 1999
 * (C) Copyright Deti Fliegl 1999 (new USB architecture)
 * (C) Copyright Randy Dunlap 2000
 * (C) Copyright David Brownell 2000 (kernel hotplug, usb_device_id)
 * (C) Copyright Yggdrasil Computing, Inc. 2000
 *     (usb_device_id matching changes by Adam J. Richter)
 *
 * NOTE! This is not actually a driver at all, rather this is
 * just a collection of helper routines that implement the
 * generic USB things that the real drivers can use..
 *
 * Think of this as a "USB library" rather than anything else.
 * It should be considered a slave, with no callbacks. Callbacks
 * are evil.
 *
 * $Id: usb.c,v 1.53 2000/01/14 16:19:09 acher Exp $
 */

/**************************************************************************//**
 * @file     usbh_core.c
 * @version  V1.00
 * $Revision: 9 $
 * $Date: 14/05/29 1:14p $ 
 * @brief    NUC472/NUC442 MCU USB Host Library core
 *
 * @note
 * Copyright (C) 2013 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/   
#include <stdio.h>
#include <string.h>

#include "NUC472_442.h"
#include "usbh_core.h"
#include "usbh_ohci.h"

/** @addtogroup NUC472_442_Device_Driver NUC472/NUC442 Device Driver
  @{
*/

/** @addtogroup NUC472_442_USBH_Driver USBH Driver
  @{
*/

/** @addtogroup NUC472_442_USBH_EXPORTED_FUNCTIONS USBH Exported Functions
  @{
*/


static volatile uint32_t  g_devmap;


/// @cond HIDDEN_SYMBOLS
/*
 * We have a per-interface "registered driver" list.
 */
LIST_HEAD(_UsbDriverList);
LIST_HEAD(_UsbBusList);

/// @endcond


/**
  * @brief    Register a device driver to USB Host Core driver
  * @param    new_driver: The USB device driver.
  * @retval   0:  Success
  */
int USBH_RegisterDriver(USB_DRIVER_T *new_driver)
{
    /* Add it to the list of known drivers */
    list_add_tail(&new_driver->driver_list, &_UsbDriverList);
    return 0;
}

/// @cond HIDDEN_SYMBOLS

const USB_DEV_ID_T  *usb_match_id(USB_DEV_T *dev, USB_IF_DESC_T *intf,
                                  const USB_DEV_ID_T *id)
{
    /* proc_connectinfo in devio.c may call us with id == NULL. */
    if (id == NULL)
        return NULL;

    /*
     *  It is important to check that id->driver_info is nonzero,
     *  since an entry that is all zeroes except for a nonzero
     *  id->driver_info is the way to create an entry that indicates 
     *  that the driver want to examine every device and interface. 
     */
    for (; id->idVendor || id->bDeviceClass || id->bInterfaceClass || id->driver_info; id++) 
    {
        if ((id->match_flags & USB_DEVICE_ID_MATCH_VENDOR) &&
            (id->idVendor != dev->descriptor.idVendor))
            continue;

        if ((id->match_flags & USB_DEVICE_ID_MATCH_PRODUCT) &&
            (id->idProduct != dev->descriptor.idProduct))
            continue;

        /* No need to test id->bcdDevice_lo != 0, since 0 is never
           greater than any unsigned number. */
        if ((id->match_flags & USB_DEVICE_ID_MATCH_DEV_LO) &&
            (id->bcdDevice_lo > dev->descriptor.bcdDevice))
            continue;

        if ((id->match_flags & USB_DEVICE_ID_MATCH_DEV_HI) &&
            (id->bcdDevice_hi < dev->descriptor.bcdDevice))
            continue;

        if ((id->match_flags & USB_DEVICE_ID_MATCH_DEV_CLASS) &&
            (id->bDeviceClass != dev->descriptor.bDeviceClass))
            continue;

        if ((id->match_flags & USB_DEVICE_ID_MATCH_DEV_SUBCLASS) &&
            (id->bDeviceSubClass!= dev->descriptor.bDeviceSubClass))
            continue;

        if ((id->match_flags & USB_DEVICE_ID_MATCH_DEV_PROTOCOL) &&
            (id->bDeviceProtocol != dev->descriptor.bDeviceProtocol))
            continue;

        if ((id->match_flags & USB_DEVICE_ID_MATCH_INT_CLASS) &&
            (id->bInterfaceClass != intf->bInterfaceClass))
            continue;

        if ((id->match_flags & USB_DEVICE_ID_MATCH_INT_SUBCLASS) &&
            (id->bInterfaceSubClass != intf->bInterfaceSubClass))
            continue;

        if ((id->match_flags & USB_DEVICE_ID_MATCH_INT_PROTOCOL) &&
            (id->bInterfaceProtocol != intf->bInterfaceProtocol))
            continue;
        return id;
    }
    return NULL;
}


/*
 *  This entrypoint gets called for each new device.
 *
 *  We now walk the list of registered USB drivers,
 *  looking for one that will accept this interface.
 *
 *  "New Style" drivers use a table describing the devices and interfaces
 *  they handle.  Those tables are available to user mode tools deciding
 *  whether to load driver modules for a new device.
 *
 *  The probe return value is changed to be a private pointer.  This way
 *  the drivers don't have to dig around in our structures to set the
 *  private pointer if they only need one interface. 
 *
 *  Returns: 0 if a driver accepted the interface, -1 otherwise
 */
static int  usb_find_interface_driver(USB_DEV_T *dev, USB_IF_DESC_T *intf)
{
    USB_LIST_T          *tmp;
    const USB_DEV_ID_T  *id;
    USB_DRIVER_T        *driver;
    int                 i;

    for (tmp = _UsbDriverList.next; tmp != &_UsbDriverList;) /* search through the driver list */
    {
        driver = list_entry(tmp, USB_DRIVER_T, driver_list);
        tmp = tmp->next;

        for (i = 0; i < dev->driver_cnt; i++)
        {
            if (dev->driver[i] == driver)
                break;
        }
        if ((i > 0) && (i >= dev->driver_cnt))
            continue;

        id = driver->id_table;
        id = usb_match_id(dev, intf, id);
        if (id) 
        {
            if (driver->probe(dev, intf, id) == 0)
            {
                dev->driver[dev->driver_cnt] = driver;
                dev->driver_cnt++;
                //USB_debug("Deivce bind driver count %d\n", dev->driver_cnt);
                return 0;
            }
        }
    }
    if (dev->driver_cnt == 0)
        USB_warning("No matching driver!!\n");
    return -1;
}

/// @endcond


/**
  * @brief    Submit an URB to USB core for data transfers.
  * @param    urb: The USB transfer request to be processed.
  * @retval   0  Success
  * @retval   Otherwise  failed
  */
int  USBH_SubmitUrb(URB_T *urb)
{
    if (urb && urb->dev)
        return urb->dev->bus->op->submit_urb(urb);
    else
    {
        return USB_ERR_NODEV;
    }
}


/**
  * @brief    Cancel an URB which has been submit to USB core.
  * @param    urb: The USB to be canceled.
  * @retval   0  Success
  * @retval   Otherwise  failed
  */
int  USBH_UnlinkUrb(URB_T *urb)
{
    if (urb && urb->dev)
        return urb->dev->bus->op->unlink_urb(urb);
    else
        return USB_ERR_NODEV;
}


/*-------------------------------------------------------------------*
 *                     COMPLETION HANDLERS                           *
 *-------------------------------------------------------------------*/

