wjw890912/Power-measurementV0.2/ADE7878_NUC422_Softwave/NUC472_NUC442_BSP_CMSIS_V3.01.000/NUC400SeriesBSP_CMSIS_V3.01.000/Library/UsbHostLib/SOURCE/Core/usbh_core.c
    memcpy(config, buffer, USB_DT_CONFIG_SIZE);
    size = config->wTotalLength;

    if (config->bNumInterfaces > USB_MAXINTERFACES) 
    {
        USB_warning("Warning - too many interfaces\n");
        return -1;
    }

    buffer += config->bLength;
    size -= config->bLength;
        
    for (i = 0; i < config->bNumInterfaces; i++) 
    {
        int numskipped;

        /* Skip over the rest of the Class Specific or Vendor */
        /*  Specific descriptors */
        numskipped = 0;
        while (size >= sizeof(USB_DESC_HDR_T)) 
        {
            header = (USB_DESC_HDR_T *)buffer;

            if ((header->bLength > size) || (header->bLength < 2)) 
            {
                USB_error("Error - invalid descriptor length of %d\n", header->bLength);
                return -1;
            }

            /* If we find another descriptor which is at or below */
            /*  us in the descriptor heirarchy then we're done  */
            if ((header->bDescriptorType == USB_DT_ENDPOINT) ||
                (header->bDescriptorType == USB_DT_INTERFACE) ||
                (header->bDescriptorType == USB_DT_CONFIG) ||
                (header->bDescriptorType == USB_DT_DEVICE))
                break;

            USB_info("skipping descriptor 0x%X\n", header->bDescriptorType);
            numskipped++;

            buffer += header->bLength;
            size -= header->bLength;
        } /* end of while */

        if (numskipped)
        {
            USB_warning("skipped %d class/vendor specific endpoint descriptors\n", numskipped);
        }

#ifdef DUMP_DEV_DESCRIPTORS
        usbh_dump_iface_descriptor((USB_IF_DESC_T *)buffer);
#endif

        retval = usb_parse_interface(dev, config->bConfigurationValue, buffer, size);
        if (retval < 0)
            return retval;
            
        /* probe drivers... */
        usb_find_interface_driver(dev, (USB_IF_DESC_T *)buffer);

        buffer += retval;
        size -= retval;
    }
    return size;
}


/*
 *  Something got disconnected. Get rid of it, and all of its children.
 */
void usbh_disconnect_device(USB_DEV_T **pdev)
{
    USB_DEV_T       *dev = *pdev;
    USB_DRIVER_T    *driver;
    int             i;

    if (!dev)
        return;

    *pdev = NULL;

    USB_info("usbh_disconnect_device - USB disconnect on device %d\n", dev->devnum);

    usbh_free_dev_urbs(dev);

    for (i = 0; i < dev->driver_cnt; i++) 
    {
        driver = dev->driver[i];
        driver->disconnect(dev);
    }

    /* Free up all the children.. */
    for (i = 0; i < USB_MAXCHILDREN; i++) 
    {
        USB_DEV_T **child = dev->children + i;
        if (*child)
            usbh_disconnect_device(child);
    }

    /* Free the device number and remove the /proc/bus/usb entry */
    if (dev->devnum > 0) 
    {
        g_devmap &= ~(1 << dev->devnum);
    }

    /* Free up the device itself */
    usbh_free_device(dev);
}


/*
 *  Connect a new USB device. This basically just initializes
 *  the USB device information and sets up the topology - it's
 *  up to the low-level driver to reset the port and actually
 *  do the setup (the upper levels don't know how to do that).
 */
void usbh_connect_device(USB_DEV_T *dev)
{
    int  devnum;
    
    dev->descriptor.bMaxPacketSize0 = 8;  /* Start off at 8 bytes  */

    for (devnum = 1; devnum < 31; devnum++)
    {
        if ((g_devmap & (1 << devnum)) == 0)
            break;
    }
    if (devnum > 31)
    {
        USB_error("Serious devnum error!\n");
        devnum = 31;
    }
    
    g_devmap |= (1 << devnum);
    dev->devnum = devnum;
}

/// @endcond HIDDEN_SYMBOLS


/*
 * These are the actual routines to send
 * and receive control messages.
 */

#define GET_TIMEOUT   1000                 /*!< USB transfer time-out setting */
#define SET_TIMEOUT   100                  /*!< USB transfer time-out setting */

/// @cond HIDDEN_SYMBOLS

int  usbh_set_address(USB_DEV_T *dev)
{
    return USBH_SendCtrlMsg(dev, usb_snddefctrl(dev), USB_REQ_SET_ADDRESS,
                0, dev->devnum, 0, NULL, 0, HZ * GET_TIMEOUT);
}

/// @endcond 

/**
  * @brief    Get a descriptor from device. 
  * @param    dev    The USB devie.
  * @param    type   Descriptor type.
  * @param    index  Index of the descriptor.
  * @param    buf    Buffer to store the descriptor.
  * @param    size   Available size of "buf"
  * @retval   0     Success
  * @retval   Otherwise   Failed
  */
int  USBH_GetDescriptor(USB_DEV_T *dev, uint8_t type, uint8_t index, 
                       void *buf, int size)
{
    int    i = 5;
    int    result = 0;
        
    memset(buf, 0, size);     /* Make sure we parse really received data */

    while (i--) 
    {
        if ((result = USBH_SendCtrlMsg(dev, usb_rcvctrlpipe(dev, 0),
            USB_REQ_GET_DESCRIPTOR, USB_DIR_IN,
            (type << 8) + index, 0, buf, size, HZ * GET_TIMEOUT)) > 0 || result == USB_ERR_PIPE)
             break;  /* retry if the returned length was 0; flaky device */
    }
    return result;
}

/// @cond HIDDEN_SYMBOLS

static int usbh_get_string_descriptor(USB_DEV_T *dev, uint16_t langid, uint8_t index, 
                 void *buf, int size)
{
    return USBH_SendCtrlMsg(dev, usb_rcvctrlpipe(dev, 0),
           USB_REQ_GET_DESCRIPTOR, USB_DIR_IN,
           (USB_DT_STRING << 8) + index, langid, buf, size, HZ * GET_TIMEOUT);
}


static int usbh_get_device_descriptor(USB_DEV_T *dev)
{
    int     ret;
    
    ret = USBH_GetDescriptor(dev, USB_DT_DEVICE, 0, &dev->descriptor, sizeof(dev->descriptor));
    return ret;    
}


int  usbh_get_protocol(USB_DEV_T *dev, int ifnum)
{
    uint8_t type;
    int     ret;

    if ((ret = USBH_SendCtrlMsg(dev, usb_rcvctrlpipe(dev, 0),
        USB_REQ_GET_PROTOCOL, USB_DIR_IN | USB_TYPE_CLASS | USB_RECIP_INTERFACE,
        0, ifnum, &type, 1, HZ * GET_TIMEOUT)) < 0)
        return ret;

    return type;
}


int  usbh_set_protocol(USB_DEV_T *dev, int ifnum, int protocol)
{
    return USBH_SendCtrlMsg(dev, usb_sndctrlpipe(dev, 0),
           USB_REQ_SET_PROTOCOL, USB_TYPE_CLASS | USB_RECIP_INTERFACE,
           protocol, ifnum, NULL, 0, HZ * SET_TIMEOUT);
}


