wjw890912/Power-measurementV0.2/ADE7878_NUC422_Softwave/NUC472_NUC442_BSP_CMSIS_V3.01.000/NUC400SeriesBSP_CMSIS_V3.01.000/Library/UsbHostLib/SOURCE/Core/usbh_core.c
int  usbh_set_idle(USB_DEV_T *dev, int ifnum, int duration, int report_id)
{
    return USBH_SendCtrlMsg(dev, usb_sndctrlpipe(dev, 0),
           USB_REQ_SET_IDLE, USB_TYPE_CLASS | USB_RECIP_INTERFACE,
           (duration << 8) | report_id, ifnum, NULL, 0, HZ * SET_TIMEOUT);
}

/// @endcond


/**
  * @brief    Clear the halt state of an endpoint.
  * @param    dev   The USB device.
  * @param    pipe  Pipe description of the endpoint.
  * @retval   0    Success
  * @retval   Otherwise   Failed
  */
int USBH_ClearHalt(USB_DEV_T *dev, int pipe)
{
    int         result;
    uint16_t    status;
    int         endp;

    endp = usb_pipeendpoint(pipe)|(usb_pipein(pipe)<<7);

    /*
    if (!usb_endpoint_halted(dev, endp & 0x0f, usb_endpoint_out(endp)))
        return 0;
    */

    result = USBH_SendCtrlMsg(dev, usb_sndctrlpipe(dev, 0),
             USB_REQ_CLEAR_FEATURE, USB_RECIP_ENDPOINT, 0, endp, NULL, 0, HZ * SET_TIMEOUT);

    /* don't clear if failed */
    if (result < 0)
        return result;

    result = USBH_SendCtrlMsg(dev, usb_rcvctrlpipe(dev, 0),
             USB_REQ_GET_STATUS, USB_DIR_IN | USB_RECIP_ENDPOINT, 0, endp,
             &status, sizeof(status), HZ * SET_TIMEOUT);
    if (result < 0)
        return result;

    if (USB_SWAP16(status) & 1)
        return USB_ERR_PIPE;          /* still halted */

    usb_endpoint_running(dev, usb_pipeendpoint(pipe), usb_pipeout(pipe));

    /* toggle is reset on clear */

    usb_settoggle(dev, usb_pipeendpoint(pipe), usb_pipeout(pipe), 0);

    return 0;
}


/**
  * @brief    Set USB device interface. 
  * @param    dev   The USB devic.
  * @param    interface    Interface number.
  * @param    alternate    Interface alternate setting number.
  * @retval   0  Success
  * @retval   Otherwise  Failed
  */
int USBH_SetInterface(USB_DEV_T *dev, char interface, char alternate)
{
    int       ret;

    if ((ret = USBH_SendCtrlMsg(dev, usb_sndctrlpipe(dev, 0),
         USB_REQ_SET_INTERFACE, USB_RECIP_INTERFACE, alternate,
         interface, NULL, 0, HZ * 5)) < 0)
        return ret;

    dev->act_iface = interface;
    dev->iface_alternate = alternate;
    dev->toggle[0] = 0;     /* 9.1.1.5 says to do this */
    dev->toggle[1] = 0;
    return 0;
}


/**
  * @brief    Set USB device interface. 
  * @param    dev  The USB devic.
  * @param    configuration   Configuration number.
  * @retval   0   Success
  * @retval   Otherwise   Failed
  */
int  USBH_SetConfiguration(USB_DEV_T *dev, int configuration)
{
    int     ret;

    if ((ret = USBH_SendCtrlMsg(dev, usb_sndctrlpipe(dev, 0),
         USB_REQ_SET_CONFIGURATION, 0, configuration, 0, NULL, 0, HZ * SET_TIMEOUT)) < 0)
          return ret;
    dev->act_config = configuration;
    dev->toggle[0] = 0;
    dev->toggle[1] = 0;
    return 0;
}


/*
 *  usbh_settle_configuration
 *
 *  1. get configuration descriptor
 *  2. set default configuration
 *  3. parse configuration
 *  4. probe USB device drivers by interface
 */
static int  usbh_settle_configuration(USB_DEV_T *dev)
{
    int         result;
    uint32_t    cfgno, length;
    uint8_t     *buffer;
    USB_CONFIG_DESC_T *desc;
    uint32_t    stack_buff[128];

    if (dev->descriptor.bNumConfigurations > USB_MAXCONFIG) 
    {
        USB_warning("Too many configurations\n");
        return USB_ERR_INVAL;
    }

    if (dev->descriptor.bNumConfigurations < 1) 
    {
        USB_warning("Not enough configurations\n");
        return USB_ERR_INVAL;
    }

    buffer = (uint8_t *)&stack_buff[0];
    desc = (USB_CONFIG_DESC_T *)buffer;
    
    for (cfgno = 0; cfgno < dev->descriptor.bNumConfigurations; cfgno++) 
    {
        /* We grab the first 8 bytes so we know how long the whole */
        /*  configuration is */
        result = USBH_GetDescriptor(dev, USB_DT_CONFIG, cfgno, buffer, 8);
        if (result < 8) 
        {
            if (result < 0)
                USB_error("Unable to get descriptor\n");
            else 
            {
                USB_error("Config descriptor too short (expected %i, got %i)\n", 8, result);
                result = USB_ERR_INVAL;
            }
            goto err;
        }
        
        /* Get the full buffer */
        length = desc->wTotalLength;

        /* Now that we know the length, get the whole thing */
        result = USBH_GetDescriptor(dev, USB_DT_CONFIG, cfgno, buffer, length);
        if (result < 0) 
        {
            USB_error("Couldn't get all of config descriptors\n");
            goto err;
        }       

        if (result < length) 
        {
            USB_error("Config descriptor too short (expected %d, got %d)\n", length, result);
            result = USB_ERR_INVAL;
            goto err;
        }

        /*
         * Set first configuration as the default configuration
         */
        if (cfgno == 0)
        {
            result = USBH_SetConfiguration(dev, desc->bConfigurationValue);
            if (result) 
            {
                USB_error("Failed to set device %d default configuration (error=%d)\n", dev->devnum, result);
                goto err;
            }
        }

#ifdef DUMP_DEV_DESCRIPTORS    
        usbh_dump_config_descriptor(desc);
#endif

        result = usb_parse_configuration(dev, desc, buffer);
        if (result > 0)
        {
            USB_warning("Descriptor data left\n");
        }
        else if (result < 0) 
        {
            USB_warning("usb_parse_configuration error\n");
            result = USB_ERR_INVAL;
            goto err;
        }
    }

    return 0;

err:
    dev->descriptor.bNumConfigurations = cfgno;
    return result;
}

/// @cond HIDDEN_SYMBOLS

/*
 * usbh_translate_string:
 *      returns string length (> 0) or error (< 0)
 */
int  usbh_translate_string(USB_DEV_T *dev, int index, char *buf, int size)
{
    int         err = 0;
    uint32_t    u, idx;
    uint8_t     tbuf[256];

    if (size == 0 || !buf || !index)
        return USB_ERR_INVAL;
    buf[0] = 0;

    /* get langid for strings if it's not yet known */
    if (!dev->have_langid) 
    {
        err = usbh_get_string_descriptor(dev, 0, 0, tbuf, 4);
        if (err < 0) 
        {
            USB_error("usbh_translate_string - error getting string descriptor 0 (error=%d)\n", err);
            goto errout;
        } 
        else if (tbuf[0] < 4) 
        {
            USB_error("usbh_translate_string - string descriptor 0 too short\n");
            err = USB_ERR_INVAL;
            goto errout;
        } 
        else 
        {
            dev->have_langid = -1;
            dev->string_langid = tbuf[2] | (tbuf[3]<< 8);
            /* always use the first langid listed */
            USB_info("USB device number %d default language ID 0x%x\n",
                   dev->devnum, dev->string_langid);
        }
    }

